УТ_для_edt/src/DataProcessors/CRM_МастерРегистрацииОбращения/CRM_МастерРегистрацииОбращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_МастерРегистрацииОбращения</name>
</mdclass:DataProcessor>

УТ_для_edt/src/InformationRegisters/CRM_НастройкиПользователей/CRM_НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.CRM_НастройкиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CRM_НастройкиПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>CRM_СправочникПартнерыЧастноеЛицо</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для физических лиц)</description>
    </items>
    <items>
      <name>CRM_СправочникПартнерыКомпания</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для юридических лиц)</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникCRM_ПотенциальныеКлиенты</name>
      <description>Контактная информация справочника &quot;Потенциальные клиенты&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИспользоватьДляОповещений</name>
    <comment>Использовать для оповещений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИмяПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерТелефона</name>
    <comment>#1651 смарт: Лопато / Телефония. Хранение истории контактной информации пользователей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОписание</name>
    <comment>#1776 смарт: Ермаков 19.04.2024 / Телефон в карточке пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/CRM_МастерРегистрацииОбращения/Forms/ФормаНастроек/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Характеристика = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ПодставлятьОтветственногоЗаКлиентаВИнтерес;
	Менеджер = РегистрыСведений.CRM_НастройкиПользователей.СоздатьМенеджерЗаписи();
	Менеджер.Настройка = Характеристика;
	Менеджер.Пользователь = Пользователи.АвторизованныйПользователь();
	Менеджер.Прочитать();
	Попытка
		ПодставлятьОтветственногоЗаКлиентаВИнтерес = Менеджер.Значение;
	Исключение
		ПодставлятьОтветственногоЗаКлиентаВИнтерес = Ложь;
	КонецПопытки;	
	
	Характеристика = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ОсновнойТипУслуг;
	Менеджер = РегистрыСведений.CRM_НастройкиПользователей.СоздатьМенеджерЗаписи();
	Менеджер.Настройка = Характеристика;
	Менеджер.Пользователь = Пользователи.АвторизованныйПользователь();
	Менеджер.Прочитать();
	Попытка
		ОсновнойТипУслуг = Менеджер.Значение;
	Исключение
		ОсновнойТипУслуг = Ложь;
	КонецПопытки;
	
	Характеристика = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ОсновнойТипОбращения;
	Менеджер = РегистрыСведений.CRM_НастройкиПользователей.СоздатьМенеджерЗаписи();
	Менеджер.Настройка = Характеристика;
	Менеджер.Пользователь = Пользователи.АвторизованныйПользователь();
	Менеджер.Прочитать();
	Попытка
		ОсновнойТипОбращения = Менеджер.Значение;
	Исключение
		ОсновнойТипОбращения = Справочники.CRM_ТипыОбращений.ПустаяСсылка();
	КонецПопытки;
	
	РежимВводаНовогоКлиента = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("CRM_МастерРегистрацииОбращения.РежимВводаНовогоКлиента", "МастерРегистрации", 1);
	
	Если РольДоступна("ПолныеПрава") Или РольДоступна("CRM_НастройкаПрограммы") Тогда
		Элементы.ГруппаОбщиеНастройки.Видимость = Истина;
		
		CRM_ОсновнойВидEmailКлиента = Константы.CRM_ОсновнойВидEmailКлиента.Получить();
		CRM_ОсновнойВидТелефонаКлиента = Константы.CRM_ОсновнойВидТелефонаКлиента.Получить();
		CRM_ОсновнойВидEmailКонтакта = Константы.CRM_ОсновнойВидEmailКонтакта.Получить();
		CRM_ОсновнойВидТелефонаКонтакта = Константы.CRM_ОсновнойВидТелефонаКонтакта.Получить();
		
		ЗаполнитьСписокВыбораВидаКИ(Элементы.CRM_ОсновнойВидEmailКлиента,
									Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
									Справочники.ВидыКонтактнойИнформации.СправочникПартнеры);
		ЗаполнитьСписокВыбораВидаКИ(Элементы.CRM_ОсновнойВидТелефонаКлиента,
									Перечисления.ТипыКонтактнойИнформации.Телефон,
									Справочники.ВидыКонтактнойИнформации.СправочникПартнеры);
		ЗаполнитьСписокВыбораВидаКИ(Элементы.CRM_ОсновнойВидEmailКонтакта,
									Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
									Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров);
		ЗаполнитьСписокВыбораВидаКИ(Элементы.CRM_ОсновнойВидТелефонаКонтакта,
									Перечисления.ТипыКонтактнойИнформации.Телефон,
									Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров);
									
	
	Иначе
		Элементы.ГруппаОбщиеНастройки.Видимость = Ложь;
	КонецЕсли;
	
	ИзмененСоставРеквизитов = Ложь;
	
	//++ #1465 смарт: Фролов 20.12.2023 //Доработать карточку интереса, заблокировать ЮрФиз
	РежимВводаНовогоКлиента = 0;
	Элементы.РежимВводаНовогоКлиента.ТолькоПросмотр=Истина;
	//-- #1465 смарт: Фролов 20.12.2023
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьСВозвратомПараметров()
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ПодставлятьОтветственногоЗаКлиентаВИнтерес", ПодставлятьОтветственногоЗаКлиентаВИнтерес);
	СтруктураВозврата.Вставить("ОсновнойТипУслуги", ОсновнойТипУслуг);
	СтруктураВозврата.Вставить("ОсновнойТипОбращения", ОсновнойТипОбращения);
	СтруктураВозврата.Вставить("ИзмененСоставРеквизитов", ИзмененСоставРеквизитов);
	
	ЭтотОбъект.Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЗакрытьСВозвратомПараметров();
КонецПроцедуры

&НаСервере
Процедура ПрименитьНаСервере()
	
	Характеристика = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ПодставлятьОтветственногоЗаКлиентаВИнтерес;
	Менеджер = РегистрыСведений.CRM_НастройкиПользователей.СоздатьМенеджерЗаписи();
	Менеджер.Настройка = Характеристика;
	Менеджер.Значение = ПодставлятьОтветственногоЗаКлиентаВИнтерес;
	Менеджер.Пользователь =Пользователи.АвторизованныйПользователь();
	Менеджер.Записать(Истина);
	
	Характеристика = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ОсновнойТипУслуг;
	Менеджер = РегистрыСведений.CRM_НастройкиПользователей.СоздатьМенеджерЗаписи();
	Менеджер.Настройка = Характеристика;
	Менеджер.Значение = ОсновнойТипУслуг;
	Менеджер.Пользователь =Пользователи.АвторизованныйПользователь();
	Менеджер.Записать(Истина);
	
	Характеристика = ПланыВидовХарактеристик.CRM_НастройкиПользователей.ОсновнойТипОбращения;
	Менеджер = РегистрыСведений.CRM_НастройкиПользователей.СоздатьМенеджерЗаписи();
	Менеджер.Настройка = Характеристика;
	Менеджер.Значение = ОсновнойТипОбращения;
	Менеджер.Пользователь =Пользователи.АвторизованныйПользователь();
	Менеджер.Записать(Истина);
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("CRM_МастерРегистрацииОбращения.РежимВводаНовогоКлиента", "МастерРегистрации", РежимВводаНовогоКлиента);
	
	Если РольДоступна("ПолныеПрава") Или РольДоступна("CRM_НастройкаПрограммы") Тогда
		Если CRM_ОсновнойВидEmailКлиента <> Константы.CRM_ОсновнойВидEmailКлиента.Получить() Тогда
			Константы.CRM_ОсновнойВидEmailКлиента.Установить(CRM_ОсновнойВидEmailКлиента);
		КонецЕсли;
		Если CRM_ОсновнойВидТелефонаКлиента <> Константы.CRM_ОсновнойВидТелефонаКлиента.Получить() Тогда
			Константы.CRM_ОсновнойВидТелефонаКлиента.Установить(CRM_ОсновнойВидТелефонаКлиента);
		КонецЕсли;
		Если CRM_ОсновнойВидEmailКонтакта <> Константы.CRM_ОсновнойВидEmailКонтакта.Получить() Тогда
			Константы.CRM_ОсновнойВидEmailКонтакта.Установить(CRM_ОсновнойВидEmailКонтакта);
		КонецЕсли;
		Если CRM_ОсновнойВидТелефонаКонтакта <> Константы.CRM_ОсновнойВидТелефонаКонтакта.Получить() Тогда
			Константы.CRM_ОсновнойВидТелефонаКонтакта.Установить(CRM_ОсновнойВидТелефонаКонтакта);
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	ПрименитьНаСервере();
	ЗакрытьСВозвратомПараметров();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСоставРеквизитов(Команда)
	Оповещение = Новый ОписаниеОповещения("НастроитьСоставРеквизитовЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.CRM_МастерРегистрацииОбращения.Форма.ФормаНастройкиСоставаРеквизитов",,ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСписокВыбораВидаКИ(Элемент, ТипКИ, РодительКИ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|ГДЕ
		|	ВидыКонтактнойИнформации.Родитель = &РодительКИ
		|	И ВидыКонтактнойИнформации.Тип = &ТипКИ";
	
	Запрос.УстановитьПараметр("ТипКИ", ТипКИ);
	Запрос.УстановитьПараметр("РодительКИ", РодительКИ);
	
	РезультатЗапросаТЗ = Запрос.Выполнить().Выгрузить();
	
	
	Элемент.РежимВыбораИзСписка = Истина;
	Элемент.КнопкаСоздания = Ложь;
	Элемент.СписокВыбора.ЗагрузитьЗначения(РезультатЗапросаТЗ.ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСоставРеквизитовЗавершение(Результат, ДопРеквизиты) Экспорт
	Если Результат = Истина Тогда
		ИзмененСоставРеквизитов = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
